### Casks: Productivity ###
cask 'adobe-acrobat-reader'
cask 'caffeine'
cask 'maccy'
cask 'obsidian'
cask 'the-unarchiver'

# Benq monitor
cask 'display-pilot'

# Window Management
cask 'rectangle'

### Casks: Fonts ###
cask 'font-dejavu-sans-mono-for-powerline'
cask 'font-hack-nerd-font'
cask 'font-open-sans'

### Casks: Development ###
cask 'github'
cask 'github-copilot-for-xcode'

### Casks: IDEs & Editors ###
cask 'pycharm-ce'
cask 'visual-studio-code'
cask 'cursor'

### Casks: Package Managers ###
cask 'miniconda'

### Casks: Communication ###
cask 'discord'
cask 'slack'
cask 'telegram'
cask 'whatsapp'
cask 'zoom'

### Casks: Media & Gaming ###
cask 'spotify'
cask 'vlc'
cask 'steam'

### Casks: Privacy & Security ###
cask 'proton-drive'
cask 'proton-mail'
cask 'proton-pass'
cask 'tor-browser'
cask 'transmission'

### Casks: Virtualization ###
cask 'virtualbox'
cask 'utm' # New

### Browser Casks ###
cask 'brave-browser'
cask 'chromium'
cask 'google-chrome'
cask 'firefox'

### VSCode Extensions ###
vscode '1yib.rust-bundle'
vscode 'asvetliakov.vscode-neovim'
vscode 'budparr.language-hugo-vscode'
vscode 'dustypomerleau.rust-syntax'
vscode 'mechatroner.rainbow-csv'
vscode 'ms-python.debugpy'
vscode 'ms-python.python'
vscode 'ms-python.vscode-pylance'
vscode 'ms-python.vscode-python-envs'
vscode 'ms-toolsai.jupyter'
vscode 'ms-toolsai.jupyter-keymap'
vscode 'ms-toolsai.jupyter-renderers'
vscode 'ms-toolsai.vscode-jupyter-cell-tags'
vscode 'ms-toolsai.vscode-jupyter-slideshow'
vscode 'ms-vscode-remote.remote-containers'
vscode 'ms-vscode-remote.remote-ssh'
vscode 'ms-vscode-remote.remote-ssh-edit'
vscode 'ms-vscode.makefile-tools'
vscode 'ms-vscode.remote-explorer'
vscode 'redhat.vscode-yaml'
vscode 'rust-lang.rust-analyzer'
vscode 'tamasfe.even-better-toml'
vscode 'visualstudioexptteam.intellicode-api-usage-examples'
vscode 'visualstudioexptteam.vscodeintellicode'
vscode 'vscodevim.vim'